espressif/esp-idf/components/soc/esp32h4/register/soc/asrc_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** ASRC_CHNL0_CFG0_REG register
 *  Control and configuration registers
 */
#define ASRC_CHNL0_CFG0_REG (DR_REG_ASRC_BASE + 0x0)
/** ASRC_CHNL0_RS2_STG1_BYPASS : R/W; bitpos: [0]; default: 1;
 *  Set this bit to bypass stage 1 re-sampler in channel0.
 */
#define ASRC_CHNL0_RS2_STG1_BYPASS    (BIT(0))
#define ASRC_CHNL0_RS2_STG1_BYPASS_M  (ASRC_CHNL0_RS2_STG1_BYPASS_V << ASRC_CHNL0_RS2_STG1_BYPASS_S)
#define ASRC_CHNL0_RS2_STG1_BYPASS_V  0x00000001U
#define ASRC_CHNL0_RS2_STG1_BYPASS_S  0
/** ASRC_CHNL0_RS2_STG0_BYPASS : R/W; bitpos: [1]; default: 1;
 *  Set this bit to bypass stage 0 re-sampler in channel0.
 */
#define ASRC_CHNL0_RS2_STG0_BYPASS    (BIT(1))
#define ASRC_CHNL0_RS2_STG0_BYPASS_M  (ASRC_CHNL0_RS2_STG0_BYPASS_V << ASRC_CHNL0_RS2_STG0_BYPASS_S)
#define ASRC_CHNL0_RS2_STG0_BYPASS_V  0x00000001U
#define ASRC_CHNL0_RS2_STG0_BYPASS_S  1
/** ASRC_CHNL0_FRAC_BYPASS : R/W; bitpos: [2]; default: 1;
 *  Set this bit to bypass fractional re-sampler in channel0.
 */
#define ASRC_CHNL0_FRAC_BYPASS    (BIT(2))
#define ASRC_CHNL0_FRAC_BYPASS_M  (ASRC_CHNL0_FRAC_BYPASS_V << ASRC_CHNL0_FRAC_BYPASS_S)
#define ASRC_CHNL0_FRAC_BYPASS_V  0x00000001U
#define ASRC_CHNL0_FRAC_BYPASS_S  2
/** ASRC_CHNL0_RS2_STG1_MODE : R/W; bitpos: [3]; default: 0;
 *  Write this bit to configure stage 1 re-sampler mode in channel0, 0: interpolation
 *  by  factor of 2, 1: decimation by  factor of 2.
 */
#define ASRC_CHNL0_RS2_STG1_MODE    (BIT(3))
#define ASRC_CHNL0_RS2_STG1_MODE_M  (ASRC_CHNL0_RS2_STG1_MODE_V << ASRC_CHNL0_RS2_STG1_MODE_S)
#define ASRC_CHNL0_RS2_STG1_MODE_V  0x00000001U
#define ASRC_CHNL0_RS2_STG1_MODE_S  3
/** ASRC_CHNL0_RS2_STG0_MODE : R/W; bitpos: [4]; default: 0;
 *  Write this bit to configure stage 0 re-sampler mode in channel0, 0: interpolation
 *  by  factor of 2, 1: decimation by  factor of 2.
 */
#define ASRC_CHNL0_RS2_STG0_MODE    (BIT(4))
#define ASRC_CHNL0_RS2_STG0_MODE_M  (ASRC_CHNL0_RS2_STG0_MODE_V << ASRC_CHNL0_RS2_STG0_MODE_S)
#define ASRC_CHNL0_RS2_STG0_MODE_V  0x00000001U
#define ASRC_CHNL0_RS2_STG0_MODE_S  4
/** ASRC_CHNL0_FRAC_AHEAD : R/W; bitpos: [5]; default: 0;
 *  Set this bit to move fraction re-sampler to the first stage in channel0, it should
 *  be 1 when input frequency is higher the output.
 */
#define ASRC_CHNL0_FRAC_AHEAD    (BIT(5))
#define ASRC_CHNL0_FRAC_AHEAD_M  (ASRC_CHNL0_FRAC_AHEAD_V << ASRC_CHNL0_FRAC_AHEAD_S)
#define ASRC_CHNL0_FRAC_AHEAD_V  0x00000001U
#define ASRC_CHNL0_FRAC_AHEAD_S  5
/** ASRC_CHNL0_MODE : R/W; bitpos: [8:7]; default: 0;
 *  Write the bit to configure the channel mode,0: in and out are both mono, 1: in and
 *  out is both dual, 2: in is mono, out is dual, 3, in is dual, out is mono.
 */
#define ASRC_CHNL0_MODE    0x00000003U
#define ASRC_CHNL0_MODE_M  (ASRC_CHNL0_MODE_V << ASRC_CHNL0_MODE_S)
#define ASRC_CHNL0_MODE_V  0x00000003U
#define ASRC_CHNL0_MODE_S  7
/** ASRC_CHNL0_SEL : R/W; bitpos: [9]; default: 0;
 *  Write the bit to configure which 16bits data will be processing.
 */
#define ASRC_CHNL0_SEL    (BIT(9))
#define ASRC_CHNL0_SEL_M  (ASRC_CHNL0_SEL_V << ASRC_CHNL0_SEL_S)
#define ASRC_CHNL0_SEL_V  0x00000001U
#define ASRC_CHNL0_SEL_S  9

/** ASRC_CHNL0_CFG1_REG register
 *  Control and configuration registers
 */
#define ASRC_CHNL0_CFG1_REG (DR_REG_ASRC_BASE + 0x4)
/** ASRC_CHNL0_FRAC_M : R/W; bitpos: [9:0]; default: 0;
 *  Write the bits to specify the denominator of factor of fraction re-sampler in
 *  channel0, reg_chnl0_frac_m and reg_chnl0_frac_l are relatively prime.
 */
#define ASRC_CHNL0_FRAC_M    0x000003FFU
#define ASRC_CHNL0_FRAC_M_M  (ASRC_CHNL0_FRAC_M_V << ASRC_CHNL0_FRAC_M_S)
#define ASRC_CHNL0_FRAC_M_V  0x000003FFU
#define ASRC_CHNL0_FRAC_M_S  0
/** ASRC_CHNL0_FRAC_L : R/W; bitpos: [19:10]; default: 0;
 *  Write the bits to specify the nominator of factor of fraction re-sampler in
 *  channel0, reg_chnl0_frac_l and reg_chnl0_frac_m are relatively prime.
 */
#define ASRC_CHNL0_FRAC_L    0x000003FFU
#define ASRC_CHNL0_FRAC_L_M  (ASRC_CHNL0_FRAC_L_V << ASRC_CHNL0_FRAC_L_S)
#define ASRC_CHNL0_FRAC_L_V  0x000003FFU
#define ASRC_CHNL0_FRAC_L_S  10

/** ASRC_CHNL0_CFG2_REG register
 *  Control and configuration registers
 */
#define ASRC_CHNL0_CFG2_REG (DR_REG_ASRC_BASE + 0x8)
/** ASRC_CHNL0_FRAC_RECIPL : R/W; bitpos: [19:0]; default: 0;
 *  Write the bits with ((2^19+L)/(2L)) round down in channel0.
 */
#define ASRC_CHNL0_FRAC_RECIPL    0x000FFFFFU
#define ASRC_CHNL0_FRAC_RECIPL_M  (ASRC_CHNL0_FRAC_RECIPL_V << ASRC_CHNL0_FRAC_RECIPL_S)
#define ASRC_CHNL0_FRAC_RECIPL_V  0x000FFFFFU
#define ASRC_CHNL0_FRAC_RECIPL_S  0

/** ASRC_CHNL0_CFG3_REG register
 *  Control and configuration registers
 */
#define ASRC_CHNL0_CFG3_REG (DR_REG_ASRC_BASE + 0xc)
/** ASRC_CHNL0_RESET : WT; bitpos: [0]; default: 0;
 *  Set this bit to reset channel0.
 */
#define ASRC_CHNL0_RESET    (BIT(0))
#define ASRC_CHNL0_RESET_M  (ASRC_CHNL0_RESET_V << ASRC_CHNL0_RESET_S)
#define ASRC_CHNL0_RESET_V  0x00000001U
#define ASRC_CHNL0_RESET_S  0

/** ASRC_CHNL0_CFG4_REG register
 *  Control and configuration registers
 */
#define ASRC_CHNL0_CFG4_REG (DR_REG_ASRC_BASE + 0x10)
/** ASRC_CHNL0_START : R/W; bitpos: [0]; default: 0;
 *  Set this bit to start channel0.
 */
#define ASRC_CHNL0_START    (BIT(0))
#define ASRC_CHNL0_START_M  (ASRC_CHNL0_START_V << ASRC_CHNL0_START_S)
#define ASRC_CHNL0_START_V  0x00000001U
#define ASRC_CHNL0_START_S  0

/** ASRC_CHNL0_CFG5_REG register
 *  Control and configuration registers
 */
#define ASRC_CHNL0_CFG5_REG (DR_REG_ASRC_BASE + 0x14)
/** ASRC_CHNL0_IN_CNT_ENA : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable in data byte counter.
 */
#define ASRC_CHNL0_IN_CNT_ENA    (BIT(0))
#define ASRC_CHNL0_IN_CNT_ENA_M  (ASRC_CHNL0_IN_CNT_ENA_V << ASRC_CHNL0_IN_CNT_ENA_S)
#define ASRC_CHNL0_IN_CNT_ENA_V  0x00000001U
#define ASRC_CHNL0_IN_CNT_ENA_S  0
/** ASRC_CHNL0_IN_CNT_CLR : WT; bitpos: [1]; default: 0;
 *  Set this bit to clear in data byte counter.
 */
#define ASRC_CHNL0_IN_CNT_CLR    (BIT(1))
#define ASRC_CHNL0_IN_CNT_CLR_M  (ASRC_CHNL0_IN_CNT_CLR_V << ASRC_CHNL0_IN_CNT_CLR_S)
#define ASRC_CHNL0_IN_CNT_CLR_V  0x00000001U
#define ASRC_CHNL0_IN_CNT_CLR_S  1
/** ASRC_CHNL0_IN_LEN : R/W; bitpos: [31:8]; default: 0;
 *  Write the bits to specify the data byte number of data from the DMA
 */
#define ASRC_CHNL0_IN_LEN    0x00FFFFFFU
#define ASRC_CHNL0_IN_LEN_M  (ASRC_CHNL0_IN_LEN_V << ASRC_CHNL0_IN_LEN_S)
#define ASRC_CHNL0_IN_LEN_V  0x00FFFFFFU
#define ASRC_CHNL0_IN_LEN_S  8

