espressif/esp-idf/components/soc/esp32h4/register/soc/asrc_reg.h
/** ASRC_SYS_REG register
 *  Control and configuration
 */
#define ASRC_SYS_REG (DR_REG_ASRC_BASE + 0xf8)
/** ASRC_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Reserved
 */
#define ASRC_CLK_EN    (BIT(0))
#define ASRC_CLK_EN_M  (ASRC_CLK_EN_V << ASRC_CLK_EN_S)
#define ASRC_CLK_EN_V  0x00000001U
#define ASRC_CLK_EN_S  0
/** ASRC_CHNL0_CLK_FO : R/W; bitpos: [1]; default: 0;
 *  Set this bit to make channel0 clock free run.
 */
#define ASRC_CHNL0_CLK_FO    (BIT(1))
#define ASRC_CHNL0_CLK_FO_M  (ASRC_CHNL0_CLK_FO_V << ASRC_CHNL0_CLK_FO_S)
#define ASRC_CHNL0_CLK_FO_V  0x00000001U
#define ASRC_CHNL0_CLK_FO_S  1
/** ASRC_CHNL1_CLK_FO : R/W; bitpos: [2]; default: 0;
 *  Set this bit to make channel1 clock free run.
 */
#define ASRC_CHNL1_CLK_FO    (BIT(2))
#define ASRC_CHNL1_CLK_FO_M  (ASRC_CHNL1_CLK_FO_V << ASRC_CHNL1_CLK_FO_S)
#define ASRC_CHNL1_CLK_FO_V  0x00000001U
#define ASRC_CHNL1_CLK_FO_S  2
/** ASRC_CHNL0_OUTFIFO_CLK_FO : R/W; bitpos: [3]; default: 0;
 *  Set this bit to make channel0 outfifo clock free run.
 */
#define ASRC_CHNL0_OUTFIFO_CLK_FO    (BIT(3))
#define ASRC_CHNL0_OUTFIFO_CLK_FO_M  (ASRC_CHNL0_OUTFIFO_CLK_FO_V << ASRC_CHNL0_OUTFIFO_CLK_FO_S)
#define ASRC_CHNL0_OUTFIFO_CLK_FO_V  0x00000001U
#define ASRC_CHNL0_OUTFIFO_CLK_FO_S  3
/** ASRC_CHNL0_INFIFO_CLK_FO : R/W; bitpos: [4]; default: 0;
 *  Set this bit to make channel0 infifo clock free run.
 */
#define ASRC_CHNL0_INFIFO_CLK_FO    (BIT(4))
#define ASRC_CHNL0_INFIFO_CLK_FO_M  (ASRC_CHNL0_INFIFO_CLK_FO_V << ASRC_CHNL0_INFIFO_CLK_FO_S)
#define ASRC_CHNL0_INFIFO_CLK_FO_V  0x00000001U
#define ASRC_CHNL0_INFIFO_CLK_FO_S  4
/** ASRC_CHNL1_OUTFIFO_CLK_FO : R/W; bitpos: [5]; default: 0;
 *  Set this bit to make channel1 outfifo clock free run.
 */
#define ASRC_CHNL1_OUTFIFO_CLK_FO    (BIT(5))
#define ASRC_CHNL1_OUTFIFO_CLK_FO_M  (ASRC_CHNL1_OUTFIFO_CLK_FO_V << ASRC_CHNL1_OUTFIFO_CLK_FO_S)
#define ASRC_CHNL1_OUTFIFO_CLK_FO_V  0x00000001U
#define ASRC_CHNL1_OUTFIFO_CLK_FO_S  5
/** ASRC_CHNL1_INFIFO_CLK_FO : R/W; bitpos: [6]; default: 0;
 *  Set this bit to make channel1 infifo clock free run.
 */
#define ASRC_CHNL1_INFIFO_CLK_FO    (BIT(6))
#define ASRC_CHNL1_INFIFO_CLK_FO_M  (ASRC_CHNL1_INFIFO_CLK_FO_V << ASRC_CHNL1_INFIFO_CLK_FO_S)
#define ASRC_CHNL1_INFIFO_CLK_FO_V  0x00000001U
#define ASRC_CHNL1_INFIFO_CLK_FO_S  6

/** ASRC_DATE_REG register
 *  Control and configuration registers
 */
#define ASRC_DATE_REG (DR_REG_ASRC_BASE + 0xfc)
/** ASRC_DATE : R/W; bitpos: [27:0]; default: 37777984;
 *  Reserved
 */
#define ASRC_DATE    0x0FFFFFFFU
#define ASRC_DATE_M  (ASRC_DATE_V << ASRC_DATE_S)
#define ASRC_DATE_V  0x0FFFFFFFU
#define ASRC_DATE_S  0

#ifdef __cplusplus
}
#endif
